; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_11 ?v8 ?v10)
             (pred_8 ?v1 ?v7)
             (pred_7 ?v8 ?v7)
             (pred_6 ?v3 ?v8 )
	     (pred_10 ?v8)
             (pred_1 ?v6)
             (pred_9 ?v1)
             (pred_12 ?v7)
             (pred_2 ?v8)
             (pred_3 ?v1)
             (pred_4 ?v8)
             (pred_5 ))



(:action op_1
:parameters (?v9 ?v13 ?v2 ?v11)
:precondition (and (pred_1 ?v9) (pred_1 ?v13) (pred_9 ?v2) (pred_12 ?v11)
          (pred_11 ?v9 ?v13) (pred_8 ?v2 ?v11)
                   (pred_7 ?v13 ?v11) (pred_10 ?v9) 
                   (pred_2 ?v13) (pred_3 ?v2))
:effect (and  (pred_4 ?v13) (not (pred_2 ?v13))))


(:action op_5
:parameters (?v9 ?v4)
:precondition (and (pred_1 ?v9) (pred_1 ?v4)
               (pred_10 ?v9) (pred_11 ?v9 ?v4) (pred_4 ?v4))
:effect (and (pred_10 ?v4) (not (pred_10 ?v9))))

(:action op_2
:parameters (?v9 ?v2)
:precondition (and (pred_1 ?v9) (pred_9 ?v2) 
                  (pred_10 ?v9) (pred_6 ?v2 ?v9) (pred_5 ))
:effect (and (pred_3 ?v2)
   (not (pred_6 ?v2 ?v9)) (not (pred_5 ))))


(:action op_4
:parameters (?v9 ?v12 ?v5)
:precondition (and (pred_1 ?v9) (pred_9 ?v12) (pred_9 ?v5)
                  (pred_10 ?v9) (pred_3 ?v5) (pred_6 ?v12 ?v9))
:effect (and (pred_3 ?v12) (pred_6 ?v5 ?v9)
        (not (pred_3 ?v5)) (not (pred_6 ?v12 ?v9))))

(:action op_3
:parameters (?v9 ?v2)
:precondition (and (pred_1 ?v9) (pred_9 ?v2) 
                  (pred_10 ?v9) (pred_3 ?v2))
:effect (and (pred_5 ) (pred_6 ?v2 ?v9) (not (pred_3 ?v2)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_07 obj_06 obj_08 obj_25 obj_19 obj_09 obj_05 obj_12 obj_29 obj_18 obj_30 obj_03 obj_04 obj_22 obj_23 obj_15 obj_21 obj_26 obj_28 obj_01 obj_16 obj_14 obj_27 obj_20 obj_02
    obj_11 obj_17
    obj_10 obj_13 obj_24
    )

    (:init
       (pred_5)

       (pred_1 obj_07)
       (pred_1 obj_06)
       (pred_1 obj_08)
       (pred_1 obj_25)
       (pred_1 obj_19)
       (pred_1 obj_09)
       (pred_1 obj_05)
       (pred_1 obj_12)
       (pred_1 obj_29)
       (pred_1 obj_18)
       (pred_1 obj_30)
       (pred_1 obj_03)
       (pred_1 obj_04)
       (pred_1 obj_22)
       (pred_1 obj_23)
       (pred_1 obj_15)
       (pred_1 obj_21)
       (pred_1 obj_26)
       (pred_1 obj_28)
       (pred_1 obj_01)
       (pred_1 obj_16)
       (pred_1 obj_14)
       (pred_1 obj_27)
       (pred_1 obj_20)
       (pred_1 obj_02)
       (pred_12 obj_11)
       (pred_12 obj_17)
       (pred_9 obj_10)
       (pred_9 obj_13)
       (pred_9 obj_24)

       (pred_11 obj_07 obj_09)
       (pred_11 obj_07 obj_06)
       (pred_11 obj_06 obj_05)
       (pred_11 obj_06 obj_08)
       (pred_11 obj_06 obj_07)
       (pred_11 obj_08 obj_12)
       (pred_11 obj_08 obj_25)
       (pred_11 obj_08 obj_06)
       (pred_11 obj_25 obj_29)
       (pred_11 obj_25 obj_19)
       (pred_11 obj_25 obj_08)
       (pred_11 obj_19 obj_18)
       (pred_11 obj_19 obj_25)
       (pred_11 obj_09 obj_30)
       (pred_11 obj_09 obj_05)
       (pred_11 obj_09 obj_07)
       (pred_11 obj_05 obj_03)
       (pred_11 obj_05 obj_12)
       (pred_11 obj_05 obj_06)
       (pred_11 obj_05 obj_09)
       (pred_11 obj_12 obj_04)
       (pred_11 obj_12 obj_29)
       (pred_11 obj_12 obj_08)
       (pred_11 obj_12 obj_05)
       (pred_11 obj_29 obj_22)
       (pred_11 obj_29 obj_18)
       (pred_11 obj_29 obj_25)
       (pred_11 obj_29 obj_12)
       (pred_11 obj_18 obj_23)
       (pred_11 obj_18 obj_19)
       (pred_11 obj_18 obj_29)
       (pred_11 obj_30 obj_15)
       (pred_11 obj_30 obj_03)
       (pred_11 obj_30 obj_09)
       (pred_11 obj_03 obj_21)
       (pred_11 obj_03 obj_04)
       (pred_11 obj_03 obj_05)
       (pred_11 obj_03 obj_30)
       (pred_11 obj_04 obj_26)
       (pred_11 obj_04 obj_22)
       (pred_11 obj_04 obj_12)
       (pred_11 obj_04 obj_03)
       (pred_11 obj_22 obj_28)
       (pred_11 obj_22 obj_23)
       (pred_11 obj_22 obj_29)
       (pred_11 obj_22 obj_04)
       (pred_11 obj_23 obj_01)
       (pred_11 obj_23 obj_18)
       (pred_11 obj_23 obj_22)
       (pred_11 obj_15 obj_16)
       (pred_11 obj_15 obj_21)
       (pred_11 obj_15 obj_30)
       (pred_11 obj_21 obj_14)
       (pred_11 obj_21 obj_26)
       (pred_11 obj_21 obj_03)
       (pred_11 obj_21 obj_15)
       (pred_11 obj_26 obj_27)
       (pred_11 obj_26 obj_28)
       (pred_11 obj_26 obj_04)
       (pred_11 obj_26 obj_21)
       (pred_11 obj_28 obj_20)
       (pred_11 obj_28 obj_01)
       (pred_11 obj_28 obj_22)
       (pred_11 obj_28 obj_26)
       (pred_11 obj_01 obj_02)
       (pred_11 obj_01 obj_23)
       (pred_11 obj_01 obj_28)
       (pred_11 obj_16 obj_14)
       (pred_11 obj_16 obj_15)
       (pred_11 obj_14 obj_27)
       (pred_11 obj_14 obj_21)
       (pred_11 obj_14 obj_16)
       (pred_11 obj_27 obj_20)
       (pred_11 obj_27 obj_26)
       (pred_11 obj_27 obj_14)
       (pred_11 obj_20 obj_02)
       (pred_11 obj_20 obj_28)
       (pred_11 obj_20 obj_27)
       (pred_11 obj_02 obj_01)
       (pred_11 obj_02 obj_20)
       (pred_2 obj_29)
       (pred_2 obj_27)
       (pred_2 obj_02)
       (pred_7  obj_29 obj_11)
       (pred_7  obj_27 obj_17)
       (pred_7  obj_02 obj_11)
       (pred_4 obj_07)
       (pred_4 obj_06)
       (pred_4 obj_08)
       (pred_4 obj_25)
       (pred_4 obj_19)
       (pred_4 obj_09)
       (pred_4 obj_05)
       (pred_4 obj_12)
       (pred_4 obj_18)
       (pred_4 obj_30)
       (pred_4 obj_03)
       (pred_4 obj_04)
       (pred_4 obj_22)
       (pred_4 obj_23)
       (pred_4 obj_15)
       (pred_4 obj_21)
       (pred_4 obj_26)
       (pred_4 obj_28)
       (pred_4 obj_01)
       (pred_4 obj_16)
       (pred_4 obj_14)
       (pred_4 obj_20)

       (pred_8  obj_10 obj_11)
       (pred_8  obj_13 obj_17)
       (pred_8  obj_24 obj_11)
       (pred_6 obj_10 obj_22)
       (pred_6 obj_13 obj_08)
       (pred_6 obj_24 obj_08)
       (pred_10 obj_19)
    )

    (:goal (and
       (pred_6 obj_10 obj_05)
       (pred_6 obj_13 obj_07)
       (pred_6 obj_24 obj_25)
    ))
(:constraints
  (always (not (pred_10 obj_06)))
)
)

; plan
1. (op_5 obj_19 obj_25)
   deleted: (pred_10 obj_19)
   added: (pred_10 obj_25)
   goals met: 0 of 3
2. (op_5 obj_25 obj_08)
   deleted: (pred_10 obj_25)
   added: (pred_10 obj_08)
   goals met: 0 of 3
3. (op_2 obj_08 obj_24)
   deleted: (pred_6 obj_24 obj_08) (pred_5)
   added: (pred_3 obj_24)
   goals met: 0 of 3
4. (op_5 obj_08 obj_25)
   deleted: (pred_10 obj_08)
   added: (pred_10 obj_25)
   goals met: 0 of 3
5. (op_1 obj_25 obj_29 obj_24 obj_11)
   deleted: (pred_2 obj_29)
   added: (pred_4 obj_29)
   goals met: 0 of 3
6. (op_3 obj_25 obj_24)
   deleted: (pred_3 obj_24)
   added: (pred_5) (pred_6 obj_24 obj_25)
   goals met: 1 of 3
7. (op_5 obj_25 obj_08)
   deleted: (pred_10 obj_25)
   added: (pred_10 obj_08)
   goals met: 1 of 3
8. (op_2 obj_08 obj_13)
   deleted: (pred_6 obj_13 obj_08) (pred_5)
   added: (pred_3 obj_13)
   goals met: 1 of 3
9. (op_5 obj_08 obj_25)
   deleted: (pred_10 obj_08)
   added: (pred_10 obj_25)
   goals met: 1 of 3
10. (op_5 obj_25 obj_29)
   deleted: (pred_10 obj_25)
   added: (pred_10 obj_29)
   goals met: 1 of 3
11. (op_5 obj_29 obj_22)
   deleted: (pred_10 obj_29)
   added: (pred_10 obj_22)
   goals met: 1 of 3
12. (op_4 obj_22 obj_10 obj_13)
   deleted: (pred_3 obj_13) (pred_6 obj_10 obj_22)
   added: (pred_3 obj_10) (pred_6 obj_13 obj_22)
   goals met: 1 of 3
13. (op_5 obj_22 obj_04)
   deleted: (pred_10 obj_22)
   added: (pred_10 obj_04)
   goals met: 1 of 3
14. (op_5 obj_04 obj_03)
   deleted: (pred_10 obj_04)
   added: (pred_10 obj_03)
   goals met: 1 of 3
15. (op_5 obj_03 obj_05)
   deleted: (pred_10 obj_03)
   added: (pred_10 obj_05)
   goals met: 1 of 3
16. (op_3 obj_05 obj_10)
   deleted: (pred_3 obj_10)
   added: (pred_5) (pred_6 obj_10 obj_05)
   goals met: 2 of 3
17. (op_5 obj_05 obj_12)
   deleted: (pred_10 obj_05)
   added: (pred_10 obj_12)
   goals met: 2 of 3
18. (op_5 obj_12 obj_29)
   deleted: (pred_10 obj_12)
   added: (pred_10 obj_29)
   goals met: 2 of 3
19. (op_5 obj_29 obj_22)
   deleted: (pred_10 obj_29)
   added: (pred_10 obj_22)
   goals met: 2 of 3
20. (op_2 obj_22 obj_13)
   deleted: (pred_6 obj_13 obj_22) (pred_5)
   added: (pred_3 obj_13)
   goals met: 2 of 3
21. (op_5 obj_22 obj_29)
   deleted: (pred_10 obj_22)
   added: (pred_10 obj_29)
   goals met: 2 of 3
22. (op_5 obj_29 obj_12)
   deleted: (pred_10 obj_29)
   added: (pred_10 obj_12)
   goals met: 2 of 3
23. (op_5 obj_12 obj_05)
   deleted: (pred_10 obj_12)
   added: (pred_10 obj_05)
   goals met: 2 of 3
24. (op_5 obj_05 obj_09)
   deleted: (pred_10 obj_05)
   added: (pred_10 obj_09)
   goals met: 2 of 3
25. (op_5 obj_09 obj_07)
   deleted: (pred_10 obj_09)
   added: (pred_10 obj_07)
   goals met: 2 of 3
26. (op_3 obj_07 obj_13)
   deleted: (pred_3 obj_13)
   added: (pred_5) (pred_6 obj_13 obj_07)
   goals met: 3 of 3
